# AirViscosity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryData..::..AirViscosity Property
DuctFittingAndAccessoryData Class See Also
---
The kinematic viscosity of air for the duct fitting or duct accessory, Units: (ft^2/s).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double AirViscosity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AirViscosity As Double
	Get
```

Visual C++
---
```text
public:
property double AirViscosity {
	double get ();
}
```

# See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace